[UI_TREE]
Machine = Configuration matérielle
POWER = caractéristiques de puissance
TOUCH = réglage du pied

[IPG,CO2]
MPULSE_FREQ = fréquence des impulsions de maintien (kHz)
MPULSE_RELS = temps de libération d'entretien (US)

[IPG]
MO_DELAY_STEPS = Mo retard (US)
MODECHG_DELAY = délai de commutation de mode (MS)

[YAG,DP,EP,LD]
WORK_CURRENT_TYPE = le courant entrant dans la boîte de dialogue prend une valeur
WORK_CURRENT_TYPEOption = Layer 0 Current | valeur de consigne
WORK_CURRENT = courant de fonctionnement réglé (A)

[ALL]
SAFE_DOOR = protection de porte de sécurité
SAFE_DOOROption = invalide | suspendu | abandonné
MARKEND_SCAN = position du miroir de vibration de fin de marquage
MARKEND_SCANOption =Origine|En haut à gauche|Position centrale supérieure|Centre supérieur droit|Centre droit|Bas centre|Coin inférieur|Coin inférieur|Coin gauche|Centre gauche|Position personnalisée
MARKEND_X = coordonnées x lors de la personnalisation (mm)
MARKEND_Y = coordonnées y lorsque personnalisé (mm)

[SCAN]
PREHEAT_ENABLE= si le miroir vibrant doit être préchauffé
PREHEAT_ENABLEOption= non | oui
PREHEAT_TIME = temps de préchauffage minimum (en minutes)
USE_LIMIT_JUMPDELAY = activer ou non le délai de saut
USE_LIMIT_JUMPDELAYOption = non | oui
LIMIT_JUMPLEN = distance de saut limitée (mm)
LIMIT_JUMPDELAY_MM = temps de saut par MM (US)

[BitmapPower]
BitmapPower = marquage bitmap en niveaux de gris
AUT_TIME = temps de décroissance (US)
AUT_COFF= coefficient de gain (0 - 1)

[Signal]
Signal = réglage du signal
Cycle = déclenche plusieurs fois efficace
MARK_CNT = une commande de marquage plusieurs fois
DELAY = délai de déclenchement (MS)
DLY_BETWEEN_MARK = délai entre deux marquages (MS)
MARK_END_DELAY= Time - Lapse après l'achèvement du marquage (MS)
MARK_END_PULSE_W = longueur du signal de fin de marquage (MS)
B_MARK_ONCE = mode de déclenchement
B_MARK_ONCEOption = déclencheur de niveau | déclencheur de bord
Enable_Loop_Mdt= marquage cyclique après déconnexion
Enable_Loop_MdtOption = non activé | activé
IOSELCOUNT = nombre de signaux de document sélectionnés par E / s
ENABLE_CARDTOUCH = déclenchement de la machine de descente
ENABLE_CARDTOUCHOption = non activé | activé

[UI_FACE]
ExportSysPara = exporter les paramètres…
ImportSysPara = paramètres d'importation...
OK = OK
Cancel = annuler
Apply = Application

;---------------------------------BEGIN: EMCC\HansLaserSet.dll-----------------------------------------
[DIALOG_LASERSET]

0=Laser matériel réglages des paramètres de l'Assistant

1=Étape précédente

2=Prochaine

3=Enregistrer

4=Annuler


[DIALOG_POWER]

0=Deuxième étape: mettre en place votre sélection de laser de la configuration matérielle

1=Courant plage de variation(%)

2=Courant Minimum(%):

3=Courant Maximum(A):

4=AnalogiqueQEn voiture

5=NumériqueQEn voiture

6=QType de lecteur

7=Type d'alimentation

8=CO2Laser de puissance de la taille

9=Le pouvoir ordinaire

10=Réponse rapide de l'alimentation

11=Supérieure ou égale à100W

12=Moins de100W

13=Le sustain de l'impulsion paramètres

14=Fréquence(KHZ)

15=Temps de libération(états-unis)

16=Le courant de repos(%):

17=Maximale de service de cycle de

18=La rémunération actuelle(%)

19=Laser matériel

20=MDéfinissez la valeur de l'

21=MValeur:

22=Facteur d'ajustement:

23=Normal

24=Trop grand

25=Trop petit


[DIALOG_MODEL]

0=Quatrième étape: en fonction de votre goût, choisissez votre Favori mode de contrôle

1=Un nouveau moyen de contrôle, opération simple, les utilisateurs n'ont pas besoin de mettre tout retard,Mais seulement dans le passage du laser utilisé.

2=Le laser traditionnel mode de contrôle, en ligne avec la plupart des gens, les habitudes de consommation, tous les lasers peuvent être utilisés de cette façon.

3=En mode facile

4=Mode traditionnel

5=Marquage Laser mode de contrôle

6=Tête carrée type

7=Simple mode

8=Double-tête mode


[DIALOG_LaserType]

0=Type de Laser:

1=YAGLaser

2=DPLaser

3=Laser UV

4=CO2Laser

5=TonQLaser à fibre

6=SPILaser

7=LDLaser

8=YLPM(HFM-H)Laser

9=YLP-V2Laser

10=YLPPLaser

11=HFM-UNLaser

12=HFM-PLaser

13=HFM-RLaser

14=HFM-JLaser

15=MOPARéglable en largeur d'impulsion du laser

16 = laser à fibre continue

17 = laser ultra - rapide


[DIALOG_CONTENT]

0=Cinquième étape: félicitations à vous, vos réglages ont été effectués, veuillez enregistrer les paramètres pertinents


[LaserType_Explain]

0=YAGLaser

1=DPLaser

2=Laser UV

3=CO2Laser

4=TonQLaser à fibre

5=SPILaser

6=LDLaser

7=MoPaLaser à fibre

8=YLP-V2Laser

9=YLPPLaser

10=HFM-UNLaser

11=HFM-PLaser

12=HFM-QLaser

13=HFM-JLaser

14=autres


[Model_Explain]

0=CO2 En mode facile

1=CO2 Mode traditionnel

2= TonQ, Alimentation normale+NumériqueQ Mode traditionnel

3= TonQ, Alimentation normale+AnalogiqueQ Mode traditionnel

4= TonQ, Réponse rapide de l'alimentation+NumériqueQ Mode traditionnel

5= TonQ, Réponse rapide de l'alimentation+AnalogiqueQ Mode traditionnel

6= TonQ, Alimentation normale+AnalogiqueQ En mode facile

7= TonQ, Réponse rapide de l'alimentation+NumériqueQ En mode facile

8= TonQ, Réponse rapide de l'alimentation+AnalogiqueQ En mode facile

9= IPG Mode

10=SPI En mode facile

11=SPI Mode traditionnel

12=LD Mode

13=YLPM(HFM-H) Mode traditionnel

14=YLPM(HFM-H) En mode facile

15=YLP-V2 Mode traditionnel

16=YLP-V2 En mode facile

17=YLPP Mode traditionnel

18=YLPP En mode facile

19=HFM-UN Mode traditionnel

20=HFM-UN En mode facile

21=HFM-P Mode traditionnel

22=HFM-P En mode facile

23=HFM-R Mode traditionnel

24=HFM-R En mode facile

25=HFM-J Mode traditionnel

26=HFM-J En mode facile


[DIALOG_ScanType]

0=Troisième étape: Jeu de type galvanomètre

1=Maison galvanomètre

2=D'autres galvanomètre

3=Conseils:Veuillez sélectionner la machine correspondant au type galvanomètre, Maison galvanomètre après la mise en marche d'échauffement afin de fonctionner correctement,D'autres galvanomètre sans préchauffage

;---------------------------------End: EMCC\HansLaserSet.dll-----------------------------------------

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------
[PORTDIALOGTEXT]
STATIC_0 = Arrêter l’usinage du port d’entrée
STATIC_1 = Arrêter l’usinage du port de sortie
STATIC_2 = Port de sortie
STATIC_3 = Protecteur mobile
STATIC_4 = Port d’entrée
STATIC_5 = Le laser est prêt pour la sortie
STATIC_6 = Port d’entrée
STATIC_7 = Port de sortie
STATIC_8 = sortie prête pour le logiciel
STATIC_9 = port de sortie
STATIC_10 = puissance de sortie laser
STATIC_11 = port
STATIC_12 = Sortie d’indication de lumière rouge externe
STATIC_13 = port de sortie
STATIC_14 = Port d’entrée
STATIC_15 = Accompagnement marqué
STATIC_16 = port de sortie
STATIC_17 = Fin de la sortie de marquage
STATIC_18 = port de sortie
STATIC_19 = largeur d’impulsion
STATIC_20 = sortie d’alarme laser à fibre
STATIC_21 = Port de sortie
STATIC_22 = Commencer à marquer le port
STATIC_23 = Port d’entrée
IDC_CHECK_LASERWARN = Alarme laser de détection
IDC_CHECK_PLUSE_REVERSE = inversion de niveau du signal Q
IDC_RADIO_NORMAL = Standard
IDC_RADIO_BICOLORLAMP = Lumière bicolore
IDC_RADIO_TRICOLORLIGHT = Lumière tricolore

[error]
1 = Carte non initialisée ou carte introuvable!
2 = la Réinitialisation a échoué!
3 = mauvaise version de la carte!
4 = alarme!
6 = l'exécution a échoué!
7 = le statut ne correspond pas!
16 = délai de commande dépassé!
17 = ordre perdu!
18 = l'interface appelle asynchrone!
19 = l'interface est occupée par d'autres programmes!
20 = dépassement de l'axe Z ou correction de la corruption du fichier!
21 = les paramètres ne correspondent pas!
23 = l'allocation de mémoire a échoué!
100 = hors ligne!
101 = ordre abandonné!
1001 = port 1
1002 = Port 2
1003 = port 3
1004 = port 4
1005 = Port 5
1006 = port 6
1007 = port 7
1008 = l'entrée laser n'est pas prête
1009 = Entrée laser prête

;---------------------------------END: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------
[TITLESTRING]
IDD_LASERSET_DIALOG= Réglage laser
IDD_PROPPAGE_POWER= caractéristiques de l’alimentation électrique
IDD_PROPPAGE_SYS_SET=Paramètres matériels
IDD_PROPPAGE_TOUCH= Paramètres de la pédale
IDD_PORT_SET = Paramètres de port

[IDD_DIALOG_HANSLASERSET]
CAPTION = paramètres système
IDC_BTN_SAVE= Sauvegarder
IDCANCEL= Quitter
LISTTITLE_NAME= Nom de l’article
LISTTITLE_VALUE= valeur

;---------------------------------END: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------



